Tekla Open API Reference for Tekla Structures 2025
HatchAttributes Methods
The HatchAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from GenericAttributesBase.)
Top
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace